app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `email` = 's@s'
 LIMIT 1
---
    public function processLogin()
    {
        $session = session();
        $userModel = new UserModel();

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        // Cari user berdasarkan email
        $user = $userModel->where('email', $email)->first();