app/Controllers/DashboardController.php

            $model = new KonsultasiModel();

            // Ambil SEMUA data konsultasi
            $data['pengajuan'] = $model->select('konsultasi.*, user.nama as nama_klien, user.no_telp')
                ->join('user', 'user.id_user = konsultasi.id_user')
                ->orderBy('konsultasi.created_at', 'DESC')
                ->findAll();
---
SELECT `konsultasi`.*, `user`.`nama` as `nama_klien`, `user`.`no_telp`
FROM `konsultasi`
JOIN `user` ON `user`.`id_user` = `konsultasi`.`id_user`
ORDER BY `konsultasi`.`created_at` DESC

            $db = \Config\Database::connect();

            // 1. KARTU ATAS
            $queryIncome = $db->table('user')
                ->selectSum('harga_konsultasi')
                ->join('konsultasi', 'konsultasi.no_bas = user.no_bas')
                ->whereIn('konsultasi.status', ['approved', 'completed'])
                ->get();

            $data['total_income'] = $queryIncome->getRow()->harga_konsultasi;
            $data['total_kasus'] = $konsultasiModel->where('status', 'completed')->countAllResults();
            $data['total_klien'] = $userModel->where('role', 'client')->countAllResults();
            $data['total_lawyer'] = $userModel->where('role', 'lawyer')->countAllResults();
---
SELECT SUM(`harga_konsultasi`) AS `harga_konsultasi`
FROM `user`
JOIN `konsultasi` ON `konsultasi`.`no_bas` = `user`.`no_bas`
WHERE `konsultasi`.`status` IN ('approved','completed')
SELECT COUNT(*) AS `numrows`
FROM `konsultasi`
WHERE `status` = 'completed'
SELECT COUNT(*) AS `numrows`
FROM `user`
WHERE `role` = 'client'