app/Controllers/UsersController.php

SELECT *
FROM `user`
WHERE `role` = 'lawyer'
SELECT *
FROM `user`
WHERE `role` = 'client'
---
    public function index()
    {
        if (session()->get('role') != 'sekretaris') {
            return redirect()->to('/dashboard');
        }

        // Ambil data lawyer dan klien
        $data['lawyers'] = $this->userModel->where('role', 'lawyer')->findAll();
        $data['clients'] = $this->userModel->where('role', 'client')->findAll();